
      * number53  structure
           10 int53 PIC 9(16).
           10 float53 PIC 9(16).9(15).
           10 rdpos53 PIC 9(2).
           10 numstr53 PIC X(32).
